 <?php
 $colors = array("#00FF00","#EE00FF","#00FFFF","#FFFF00","#FF0000");
 $games = array(
    array("name"=>"Noita",
    "genres"=>array("платформер","пиксельная графика","рогалик","шутер"),
    "description"=>'В игре вам нужно дойти до "конца" мира. В этой задаче вам будут мешать разные монстры на разных уровнях. Для защиты против монстров вы можете создавать разные заклинания, главное чтобы маны в жезле хватало. Сам мир процедурно генерируется, что позваоляет прочувстовать каждый забег как новый',
    "developer"=>"Nolla Games",
    "poster"=>"noita.jpg",
    "anchor"=>"noita"),

    array("name"=>"Factorio",
    "genres"=>array("симулятор","пиксельная графика","tower defense","builder"),
    "description"=>'В мире на который вы потерпели крушение вам нужно будет выживать от жуков которые из-за вас начинают становится сильнее. Вы сможете настраивать логистику ресурсов, защищатсья от жуков используя разное оружие и модифицировать технологии производства. И это только один из режимов игры. Так же игра позволяет и грать в кооперативе что приноситт более яркие краски в игру.',
    "developer"=>"Wube Software",
    "poster"=>"factorio.jpg",
    "anchor"=>"factorio"),

    array("name"=>"Dead cells",
    "genres"=>array("платформер","пиксельная графика","метроидвания"),
    "description"=>'В начале игры вы даже не будете понимать что джелать ноп о прордвижению в игре и в сюжете вы поймёте суть самой игры. Вас встретят разного рода монстры, оружие и усиление. Вы не сможете использовать одно и тоже оружие ведь это будет так скучно и так не эффективно. К разным монстрам нужно находить разный подход и в этом самое интересное. Игра вам не наскучит даже после 10-ти забегов. По прордвижениюв забеге вы сможете улучшать персонажа и открывать новое оружие',
    "developer"=>"Motion Twin",
    "poster"=>"dead_cells.jpg",
    "anchor"=>"dead_cells"),

    array("name"=>"Cult of the Lamb",
    "genres"=>array("рогалик","management simulation","builder"),
    "description"=>'Вы увидите маленького ягнёнка которого хотят принести в жертву во имя божеств, проходя к алтарю над вами поднимается топор и ... Вы увидели запертого бога который поможет вам отомстить божествам наделив вас его силой. Проходя 4 мира и развивая своё посленеия вы сможете дойти сами до запертого бога и сами решайте вашу судьбу. Помните судьбу строите вы и никто больше',
    "developer"=>"Massive Monster",
    "poster"=>"cult_ofthe_lamb.jpg",
    "anchor"=>"cult_of_the_lamb"),

    array("name"=>"Neon abyss",
    "genres"=>array("рогалик","платформер","шутер","пиксельная графика"),
    "description"=>'Игроки берут на себя роль члена «Мрачного отряда», группы, сформированной человеком, называющим себя АидомНачиная свое путешествие с неоновой подсветкиночном клубе, цель Grim Squad - исследовать подземную область, известную как Бездна, через серию процедурно сгенерированных уровней, чтобы выследить и уничтожить Новых богов, а также их последователей',
    "developer"=>"Veewo Games",
    "poster"=>"neon_abyss.jpg",
    "anchor"=>"neon_abyss"),

    array("name"=>"Katana zero",
    "genres"=>array("экшен-платформер","пиксельная графика"),
    "description"=>'Сюжет для такой игры довольно большой и глубокий по этому рекомендуем пройти игру самим. В игры вы примите роль наёмника самурая который сможет предсказыывать будущее и просичитывать все ходы. Вам нужно будет выполнять контракты, следтьб за сюжет и ходом выполнения. Вы сможете использовать замедление времени чтоб у вас было больше времени для манёвров.',
    "developer"=>"Askiisoft",
    "poster"=>"katana_zero.jpg",
    "anchor"=>"katana_zero")
    ,

    array("name"=>"Skul: The Hero Slayer",
    "genres"=>array("экшен-платформер","пиксельная графика"),
    "description"=>'Скелет Скал приходит в сознание в мире демонов. Королевство Карлеон во главе с Героем Карлеона устроили поход против демонических сил, чтобы положить конец существованию демонов.С помощью силы «тёмного кварца» имперская армия разрушает замок Короля демонов и заражает земли демонов силой «тёмного кварца». Однако Скал выжил после нападения и теперь ему предстоит спасти Короля демонов из плена',
    "developer"=>"SouthPAW Games",
    "poster"=>"skul.jpeg",
    "anchor"=>"skul")
    ,

    array("name"=>"Gunfire Reborn",
    "genres"=>array("рогалик","шутер"),
    "description"=>'Шутер от первого лица. В игре может быть от 1 до 4 игроков. В игре задача дойти до конца не умерев и тысячу раз. Вы встретите много разного оружия которое придётся кобминировать игаче патронов не хватит. Сама игра не имеет чёткого баланса да и разработчики к этому такое ощущение не стремились, но от этого сама игра бросает вам вызов. Пройдёте или нет зависит от ваших умений и везения ',
    "developer"=>"Duoyi Games",
    "poster"=>"gunfire.jpeg",
    "anchor"=>"Gunfire")
    ,
    // 
    array("name"=>"Risk of Rain 2",
    "genres"=>array("рогалик","шутер"),
    "description"=>'При первом запуске игры вас встретят 2 открытых персонажев, у каждого свои способности. Главная задача пройти все уровни но это будет не так просто так как чем дольше вы остаётесь в забеге тем толще и мощнее будут иноплаонетяни. Со временем вы откроете всех персонажев и сможете поучаствовать в роле каждого из них в коопе с другими игроками',
    "developer"=>"Hopoo Games",
    "poster"=>"risk_of_rain_2.jpg",
    "anchor"=>"risk_of_rain_2")
    ,

    array("name"=>"Oxygen Not Included",
    "genres"=>array("builder"),
    "description"=>'Главная цель игры это освоить все планеты которые будут предложены процедурносгенерированым миров. Вам придётся следить за дубликатами чтобы они не умерли раньше времени, осваивать новые технологии и планеты и обустраивать жильё дубликатов. Вы на это потратите много часов, но этим она и прекрасны. Вы сможете по большей части расслабиться ',
    "developer"=>"Klei Entertainment",
    "poster"=>"oxygen.jpg",
    "anchor"=>"oxygen")
)
?>